spec/vcr/Refund/should_create_a_refund_for_a_given_amount_and_charge.yml

---
http_interactions:
- request:
    method: post
    uri: https://<key>:@test-api.pin.net.au/1/charges/ch_NLEbb_xRgtyz58RGQ5zVqg/refunds
    body:
      encoding: UTF-8
      string: amount=400
    headers: {}
  response:
    status:
      code: 201
      message: Created
    headers:
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Fri, 05 Jul 2013 14:34:06 GMT
      Etag:
      - '"f2733c6ccb3b207cf18992e841964bf7"'
      Server:
      - Apache/2.2.20 (Ubuntu)
      Status:
      - '201'
      Strict-Transport-Security:
      - max-age=31536000
      Vary:
      - User-Agent
      X-Powered-By:
      - Phusion Passenger (mod_rails/mod_rack) 3.0.11
      X-Rack-Cache:
      - invalidate, pass
      X-Request-Id:
      - 1fbecbc2f400ef73646c4929d2d02159
      X-Runtime:
      - '0.750150'
      X-Ua-Compatible:
      - IE=Edge,chrome=1
      Content-Length:
      - '216'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"response":{"token":"rf_vrRyFemJLhyNrY3D9nFXCA","success":null,"amount":400,"currency":"AUD","charge":"ch_NLEbb_xRgtyz58RGQ5zVqg","created_at":"2013-07-05T14:34:06Z","error_message":null,"status_message":"Pending"}}'
    http_version: 
  recorded_at: Fri, 05 Jul 2013 14:34:11 GMT
recorded_with: VCR 2.5.0
